
'use client'
import React, { useRef } from "react";
import IconButton from '../utils/IconButton';
import CustomNextArrow from "../utils/CustomNextArrow";
import CustomPrevArrow from "../utils/CustomPrevArrow";
import Slider from "react-slick";
import Ellipse from "../utils/Ellipse"; 

import Link from "next/link";
// import { ChevronRightIcon } from '@heroicons/react/20/solid'

const settings = {
    dots: false,
    infinite: true,
    slidesToShow: 1,
    // centerMode: true,
    slidesToScroll: 1,
    arrows: false,
    autoplay: false,
    speed: 1000,
    autoplaySpeed: 2000,
    cssEase: "linear",
};
interface DataType {
    icon: React.ReactNode;
    title: string;
    content: string;
}

const benefits : DataType[] = [
    {
        icon: (
            <svg width="42" height="43" viewBox="0 0 42 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M30.3016 14.2785C30.1813 14.2613 30.061 14.2613 29.9408 14.2785C27.2775 14.1926 25.1641 12.0104 25.1641 9.32998C25.1641 6.59797 27.3806 4.36426 30.1298 4.36426C32.8618 4.36426 35.0955 6.58079 35.0955 9.32998C35.0783 12.0104 32.9649 14.1926 30.3016 14.2785Z" fill="#007DFC"/>
                <path d="M35.9026 26.1841C33.9781 27.4728 31.2805 27.9539 28.789 27.6274C29.442 26.2185 29.7856 24.6549 29.8028 23.0054C29.8028 21.2871 29.4248 19.6548 28.7031 18.2286C31.2461 17.885 33.9438 18.3661 35.8854 19.6548C38.6002 21.4418 38.6002 24.3799 35.9026 26.1841Z" fill="#007DFC"/>
                <path d="M11.2455 14.2785C11.3657 14.2613 11.486 14.2613 11.6063 14.2785C14.2696 14.1926 16.383 12.0104 16.383 9.32998C16.383 6.58079 14.1665 4.36426 11.4173 4.36426C8.68528 4.36426 6.46875 6.58079 6.46875 9.32998C6.46875 12.0104 8.58219 14.1926 11.2455 14.2785Z" fill="#007DFC"/>
                <path d="M11.436 23.0115C11.436 24.6782 11.7968 26.259 12.4497 27.6852C10.027 27.9429 7.50119 27.4274 5.64549 26.2075C2.93067 24.4033 2.93067 21.4651 5.64549 19.661C7.48401 18.4238 10.0786 17.9255 12.5185 18.2005C11.814 19.6438 11.436 21.2761 11.436 23.0115Z" fill="#007DFC"/>
                <path d="M21.0092 28.1969C20.8717 28.1797 20.7171 28.1797 20.5624 28.1969C17.4008 28.0938 14.875 25.4993 14.875 22.3033C14.8922 19.0387 17.5211 16.3926 20.803 16.3926C24.0676 16.3926 26.7137 19.0387 26.7137 22.3033C26.6965 25.4993 24.1879 28.0938 21.0092 28.1969Z" fill="#007DFC"/>
                <path d="M15.4225 31.7544C12.8279 33.4899 12.8279 36.3421 15.4225 38.0604C18.3779 40.0364 23.2233 40.0364 26.1787 38.0604C28.7732 36.325 28.7732 33.4727 26.1787 31.7544C23.2405 29.7785 18.3951 29.7785 15.4225 31.7544Z" fill="#007DFC"/>
            </svg>
        ),
        title: 'Creative Human Writers',
        content: "Lörem ipsum krons astroll parar.Vabamass hemirulig dåhusäbelt, desaktiv säkanera. Mikrotisam enode kasäpreska "
    },
    {
        icon: (
            <svg width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fillRule="evenodd" clipRule="evenodd" d="M19.4065 38.7592C30.0423 38.7592 38.6645 30.137 38.6645 19.5012C38.6645 8.86527 30.0423 0.243164 19.4065 0.243164C8.77054 0.243164 0.148438 8.86527 0.148438 19.5012C0.148438 30.137 8.77054 38.7592 19.4065 38.7592ZM20.8508 7.94637C20.8508 7.14868 20.2041 6.50202 19.4065 6.50202C18.6088 6.50202 17.9621 7.14868 17.9621 7.94637V8.55633C14.8222 9.11855 12.1847 11.4775 12.1847 14.6867C12.1847 18.3788 15.6758 20.9455 19.4065 20.9455C22.0573 20.9455 23.7395 22.6897 23.7395 24.3157C23.7395 25.9416 22.0573 27.6858 19.4065 27.6858C16.7556 27.6858 15.0734 25.9416 15.0734 24.3157C15.0734 23.518 14.4267 22.8713 13.629 22.8713C12.8314 22.8713 12.1847 23.518 12.1847 24.3157C12.1847 27.5248 14.8222 29.8838 17.9621 30.4461V31.056C17.9621 31.8537 18.6088 32.5003 19.4065 32.5003C20.2041 32.5003 20.8508 31.8537 20.8508 31.056V30.4461C23.9906 29.8838 26.6282 27.5248 26.6282 24.3157C26.6282 20.6235 23.1371 18.0568 19.4065 18.0568C16.7556 18.0568 15.0734 16.3126 15.0734 14.6867C15.0734 13.0608 16.7556 11.3165 19.4065 11.3165C22.0573 11.3165 23.7395 13.0608 23.7395 14.6867C23.7395 15.4844 24.3862 16.131 25.1839 16.131C25.9815 16.131 26.6282 15.4844 26.6282 14.6867C26.6282 11.4775 23.9906 9.11855 20.8508 8.55633V7.94637Z" fill="#007DFC"/>
            </svg>

        ),
        title: 'Affordable Pricing',
        content: "Lörem ipsum krons astroll parar.Vabamass hemirulig dåhusäbelt, desaktiv säkanera. Mikrotisam enode kasäpreska "
    },
    {
        icon: (
            <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fillRule="evenodd" clipRule="evenodd" d="M17.1513 34.0809C26.5461 34.0809 34.162 26.4651 34.162 17.0703C34.162 7.67552 26.5461 0.0595703 17.1513 0.0595703C7.75657 0.0595703 0.140625 7.67552 0.140625 17.0703C0.140625 26.4651 7.75657 34.0809 17.1513 34.0809ZM19.0414 6.67484C19.0414 5.63098 18.1952 4.78476 17.1513 4.78476C16.1074 4.78476 15.2612 5.63098 15.2612 6.67484V16.5977C15.2612 17.9026 16.3189 18.9603 17.6238 18.9603H23.7666C24.8105 18.9603 25.6566 18.1141 25.6566 17.0703C25.6566 16.0264 24.8105 15.1802 23.7666 15.1802H19.0414V6.67484Z" fill="#007DFC"/>
            </svg>
        ),
        title: 'On Time Delivery',
        content: "Lörem ipsum krons astroll parar.Vabamass hemirulig dåhusäbelt, desaktiv säkanera. Mikrotisam enode kasäpreska "
    },
    {
        icon: (
            <svg width="44" height="43" viewBox="0 0 44 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M21.9296 12.0979C23.7363 8.85686 24.6397 7.23633 25.9903 7.23633C27.3409 7.23633 28.2441 8.85686 30.0508 12.0979L30.5183 12.9364C31.0316 13.8574 31.2884 14.3179 31.6886 14.6218C32.0889 14.9256 32.5874 15.0384 33.5845 15.264L34.492 15.4694C38.0005 16.2632 39.7547 16.6601 40.172 18.0022C40.5893 19.3442 39.3935 20.7428 37.0017 23.5395L36.3828 24.2632C35.7031 25.0579 35.3633 25.4553 35.2105 25.9471C35.0575 26.4386 35.1089 26.9689 35.2118 28.0292L35.3052 28.9947C35.667 32.7264 35.8477 34.5923 34.755 35.4217C33.6624 36.2511 32.0199 35.4948 28.735 33.9823L27.8852 33.5911C26.9517 33.1613 26.4851 32.9464 25.9903 32.9464C25.4955 32.9464 25.0287 33.1613 24.0954 33.5911L23.2454 33.9823C19.9605 35.4948 18.3181 36.2511 17.2254 35.4217C16.1328 34.5923 16.3136 32.7264 16.6752 28.9947L16.7687 28.0292C16.8715 26.9689 16.9229 26.4386 16.77 25.9471C16.6171 25.4553 16.2773 25.0579 15.5976 24.2632L14.9788 23.5395C12.587 20.7428 11.3911 19.3442 11.8085 18.0022C12.2258 16.6601 13.98 16.2632 17.4884 15.4694L18.3961 15.264C19.393 15.0384 19.8915 14.9256 20.2918 14.6218C20.6921 14.3179 20.9488 13.8574 21.4621 12.9364L21.9296 12.0979Z" fill="#007DFC"/>
                <path fillRule="evenodd" clipRule="evenodd" d="M16.4579 9.37796C12.9248 8.35984 9.13479 8.89761 5.47809 11.0391L5.10695 11.2564C4.46966 11.6296 3.6505 11.4156 3.27727 10.7783C2.90406 10.141 3.11814 9.32181 3.75543 8.9486L4.12657 8.73126C8.3351 6.26663 12.8769 5.56277 17.1984 6.80809L17.5691 6.91489C18.2787 7.1194 18.6882 7.86045 18.4837 8.5701C18.2793 9.27975 17.5382 9.68926 16.8285 9.48476L16.4579 9.37796ZM9.48794 17.8186C9.55063 18.5545 9.00492 19.2019 8.26906 19.2645C7.99598 19.2878 7.78661 19.301 7.61115 19.3122C7.29489 19.3322 7.08881 19.3454 6.81839 19.3973C6.46806 19.4645 6.01317 19.6068 5.18766 20.0195C4.52709 20.3499 3.72387 20.0821 3.39359 19.4215C3.06332 18.7609 3.33105 17.9577 3.99162 17.6275C4.94905 17.1488 5.64395 16.8994 6.31426 16.7707C6.75447 16.6862 7.20889 16.6566 7.61755 16.63C7.76605 16.6203 7.90851 16.6111 8.04205 16.5997C8.7779 16.537 9.42525 17.0827 9.48794 17.8186ZM11.4164 28.3731C9.30544 27.8783 7.08139 28.3689 5.41723 29.6801C4.83715 30.1373 3.99636 30.0374 3.53928 29.4574C3.08222 28.8773 3.18194 28.0366 3.76204 27.5795C6.07595 25.7562 9.1364 25.0919 12.0266 25.769C12.7456 25.9375 13.1919 26.6571 13.0234 27.3762C12.8549 28.0953 12.1354 28.5415 11.4164 28.3731Z" fill="#007DFC"/>
            </svg>
        ),
        title: 'Excellent Experience',
        content: "Lörem ipsum krons astroll parar.Vabamass hemirulig dåhusäbelt, desaktiv säkanera. Mikrotisam enode kasäpreska "
    },
    {
        icon: (
            <svg width="33" height="36" viewBox="0 0 33 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M16.468 0.175781V12.6266C18.5724 13.3281 19.9753 15.2571 19.9753 17.5368C19.9753 18.4137 19.8 19.2905 19.2739 19.9919L22.7812 22.7978C22.9565 22.7978 23.1319 22.6224 23.4826 22.6224C24.5348 22.6224 25.2362 23.3239 25.2362 24.376C25.2362 25.4282 24.5348 26.1297 23.4826 26.1297C22.4304 26.1297 21.729 25.4282 21.729 24.376V24.2007L18.2217 21.3948C17.3449 22.2717 16.1173 22.7978 14.7144 22.7978C11.7332 22.7978 9.45347 20.518 9.45347 17.5368C9.45347 15.2571 10.8564 13.3281 12.9608 12.6266V0.351145H12.7854C6.64765 1.0526 1.56209 6.13816 0.860629 12.4513C0.334536 16.3093 1.38672 19.8166 3.49109 22.6224C5.06937 24.7268 5.94619 27.0065 5.94619 29.637V35.2486H21.729V29.9877H25.2362C27.1653 29.9877 28.7435 28.4094 28.7435 26.4804V21.2195L31.374 20.1673C32.0755 19.8166 32.4262 18.7644 32.0755 18.0629L28.7435 12.802C28.0421 6.31353 22.9565 1.0526 16.468 0.175781ZM14.7144 15.0817C13.3115 15.0817 12.0839 16.3093 12.0839 17.7122C12.0839 19.1151 13.3115 20.3427 14.7144 20.3427C16.1173 20.3427 17.3449 19.1151 17.3449 17.7122C17.3449 16.3093 16.1173 15.0817 14.7144 15.0817Z" fill="#007DFC"/>
            </svg>
         ),
        title: '24/7 Support',
        content: "Lörem ipsum krons astroll parar.Vabamass hemirulig dåhusäbelt, desaktiv säkanera. Mikrotisam enode kasäpreska "
    },
    {
        icon: (
            <svg width="33" height="37" viewBox="0 0 33 37" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fillRule="evenodd" clipRule="evenodd" d="M2.80082 2.98735C0.742187 5.046 0.742188 8.35933 0.742188 14.986V22.0146C0.742188 28.6413 0.742187 31.9547 2.80082 34.0132C4.85948 36.0719 8.1728 36.0719 14.7995 36.0719H18.3138C24.9404 36.0719 28.2539 36.0719 30.3124 34.0132C32.3711 31.9547 32.3711 28.6413 32.3711 22.0146V14.986C32.3711 8.35933 32.3711 5.046 30.3124 2.98735C28.2539 0.928711 24.9404 0.928711 18.3138 0.928711H14.7995C8.1728 0.928711 4.85948 0.928711 2.80082 2.98735ZM9.528 13.6681C8.80016 13.6681 8.21012 14.2582 8.21012 14.986C8.21012 15.7138 8.80016 16.3039 9.528 16.3039H23.5853C24.3131 16.3039 24.9032 15.7138 24.9032 14.986C24.9032 14.2582 24.3131 13.6681 23.5853 13.6681H9.528ZM9.528 20.6968C8.80016 20.6968 8.21012 21.2868 8.21012 22.0146C8.21012 22.7425 8.80016 23.3325 9.528 23.3325H18.3138C19.0416 23.3325 19.6317 22.7425 19.6317 22.0146C19.6317 21.2868 19.0416 20.6968 18.3138 20.6968H9.528Z" fill="#007DFC"/>
            </svg>

        ),
        title: 'Unique Content',
        content: "Lörem ipsum krons astroll parar.Vabamass hemirulig dåhusäbelt, desaktiv säkanera. Mikrotisam enode kasäpreska "
    },
]

const Index = () => {
    const sliderRef = useRef<Slider>(null);
    
    return (
        <div className="relative  mt-12 md:mt-24 p-6 pt-16 sm:px-[10%] md:px-0 md:pt-20 lg:pt-24 pb-16 md:pb-20 lg:pb-28 bg-[#F2F8FF] overflow-hidden">
            <div className='ctm-container relative flex flex-col overflow-hidden gap-8 z-40'>
                <div className="text-center w-full mx-auto max-w-3xl mb-5">
                    <h1 className="banner-title">
                        Benefits for Using MissilBets  
                    </h1>
                </div>
                <div className="w-full hidden md:block">
                    <div className='grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 my-5 gap-x-6 lg:gap-x-10'>
                        { benefits.map((b, idx) => (
                            <div className='mt-4 group text-left' key={idx}>
                                <IconButton
                                    icon={b.icon}
                                />
                                <h4 className='text-2xl md:text-3xl lg:text-4xl font-semibold  text-black my-6'>{b.title}</h4>
                                <p className='text-xl lg:text-2xl text-[#595959]'>{b.content}</p>
                            </div>
                        ))}
                    </div>
                </div>
                <div className="w-full block md:hidden ">
                    <Slider {...settings} ref={sliderRef}>
                        { benefits.map((b, idx) => 
                            <div className='px-4 group text-center' key={idx}>
                                <IconButton
                                    icon={b.icon}
                                />
                                <h4 className='text-2xl md:text-3xl lg:text-4xl font-semibold  text-black my-6'>{b.title}</h4>
                                <p className='text-xl lg:text-2xl text-[#595959]'>{b.content}</p>
                            </div>
                        )}
                    </Slider>
                </div>
                <div className="w-full block md:hidden flex flex-row justify-center gap-3">
                    <CustomPrevArrow  ctmClassName="bg-[#007DFC]" onClick={() => { sliderRef.current?.slickPrev() }} />
                    <CustomNextArrow  ctmClassName="bg-[#007DFC]" onClick={() => { sliderRef.current?.slickNext() }} />
                </div>
                <Link href='/auth/login'>
                    <div className="w-full flex justify-center gap-5">
                        <button className="ctm-btn bg-[#007DFC] text-white px-[35px] text-xl font-bold">Get Started Today</button>
                    </div>
                </Link>
            </div>
            <Ellipse width="350px" height="350px" left="200px" top="250px" opacity="0.1" className="hidden lg:block" zindex="10" />
            <Ellipse width="350px" height="350px" left="90%" top="80%" opacity="0.1" className="hidden lg:block" zindex="10" />
        </div>
    )
}

export default Index;
